Data Manipulation Language (DML) in SQL Server is used to manage data within the database. It includes commands like `INSERT`, `UPDATE`, and `DELETE`. In this tutorial, we'll cover these commands along with examples and exercises.

## 1. INSERT Statement 
The INSERT statement is used to add new rows of data into a table.

```
INSERT INTO TableName
VALUES (value1, value2, ...);

```

In [ ]:
USE online_bookstore

In [2]:
INSERT INTO Books
VALUES (100, 'Song of Ice and Fire', 'George RR Martins', 5000, 10, 'Fiction');

#### Case Study Exercise 1:

Consider a Books table with columns (Book_ID, Title, Author, Price, Inventory_count, Genre). Insert a new book with the following details:

- Book_ID: 200
- Title: A Gentleman in Moscow
- Author: Amor Towles
- Price: 3500
- Inventory_count: 20
- Genre: Fiction

## 2. UPDATE Statement

The `UPDATE` statement is used to modify existing records in a table.

```bash
UPDATE TableName
SET column1 = value1, column2 = value2, ...
WHERE condition;

```

In [3]:
UPDATE Books
SET Genre = 'Non-Fiction'
WHERE Book_ID = 100;

#### Case Study Exercise 2:

Consider the Books table again. Update the Genre of the book named "Song of Ice and Fire".




## 3. DELETE Statement

The `DELETE` statement is used to remove rows from a table.

```bash
DELETE FROM TableName
WHERE condition;

```

In [5]:
DELETE FROM Books
WHERE Book_ID = 100;

## Exercise

Create an Employee Management System database. Consider the following Employee table:

```
CREATE TABLE Employees (
    EmployeeID INT PRIMARY KEY,
    Name VARCHAR(255),
    Department VARCHAR(100),
    Salary DECIMAL(10,2)
);

```

1. Insert a new employee into the Employees table with the following details:

EmployeeID: 101 Name: Jane Doe Department: Marketing Salary: 55000.00

2. Update the salary of the employee with EmployeeID 101 to 60000.00.
    
3. Delete the employee record with EmployeeID 101 from the Employees table.
    

Create a Product Inventory Management System database. Consider the following tables for a product inventory management system.

```
CREATE TABLE Products (
    ProductID INT PRIMARY KEY,
    ProductName VARCHAR(255),
    Category VARCHAR(100),
    UnitPrice DECIMAL(10,2),
    QuantityInStock INT
);

CREATE TABLE Orders (
    OrderID INT PRIMARY KEY,
    CustomerID INT,
    OrderDate DATE,
    TotalAmount DECIMAL(10,2)
);

```

1. Insert a new product into the Products table with the following details:

    - ProductID: 101
    - ProductName: Laptop
    - Category: Electronics
    - UnitPrice: 1200.00
    - QuantityInStock: 10

2. Update the quantity in stock of the product with ProductID 101 to 15.

3. Delete the product record with ProductID 101 from the Products table.

4. Insert a new order into the Orders table with the following details:

    - OrderID: 1001
    - CustomerID: 001
    - OrderDate: '2024-02-11'
    - TotalAmount: 2500.00

5. Update the total amount of order with OrderID 1001 to 2800.00.

6. Delete the order record with OrderID 1001 from the Orders table.

Create a Social Media Platform database. Consider the following tables for a social media platform.

```bash
CREATE TABLE Users (
    UserID INT PRIMARY KEY,
    Username VARCHAR(255),
    Email VARCHAR(255),
    DateOfBirth DATE
);

CREATE TABLE Posts (
    PostID INT PRIMARY KEY,
    UserID INT,
    PostContent VARCHAR(MAX),
    PostDate DATETIME
);

```

1. Insert a new user into the Users table with the following details:

    - UserID: 101
    - Username: johndoe
    - Email: johndoe@example.com
    - DateOfBirth: '1995-08-15'

2. Update the email of the user with UserID 101 to jdoe@example.com.

3. Delete the user record with UserID 101 from the Users table.

4. Insert a new post into the Posts table with the following details:

    - PostID: 1001
    - UserID: 201
    - PostContent: "Hello world!"
    - PostDate: '2024-02-11 10:00:00'

5. Update the post content of the post with PostID 1001 to "Goodbye world!".

6. Delete the post record with PostID 1001 from the Posts table.